<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,8192" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="fc1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 8192" offset="0" size="33554432" />
			<output>
				<port id="0" precision="FP16" names="fc1.weight">
					<dim>2048</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="fc1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/fc1/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_12_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="5" name="Constant_12" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="Multiply_15" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_13_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="8" name="Constant_13" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="fc1.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048" offset="33554434" size="4096" />
			<output>
				<port id="0" precision="FP16" names="fc1.bias">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="fc1.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_16" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/fc1/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc1/Gemm_output_0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="fc2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 2048" offset="33558530" size="4194304" />
			<output>
				<port id="0" precision="FP16" names="fc2.weight">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="fc2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/fc2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_19_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="18" name="Constant_19" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="19" name="Multiply_22" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_20_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="21" name="Constant_20" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="fc2.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024" offset="37752834" size="2048" />
			<output>
				<port id="0" precision="FP16" names="fc2.bias">
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="fc2.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/fc2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc2/Gemm_output_0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_1_output_0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="fc3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 1024" offset="37754882" size="1048576" />
			<output>
				<port id="0" precision="FP16" names="fc3.weight">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="fc3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/fc3/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_26_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="31" name="Constant_26" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="32" name="Multiply_29" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_27_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="34" name="Constant_27" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="35" name="fc3.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512" offset="38803458" size="1024" />
			<output>
				<port id="0" precision="FP16" names="fc3.bias">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="fc3.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_30" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/fc3/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc3/Gemm_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_2_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="fc4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 512" offset="38804482" size="131072" />
			<output>
				<port id="0" precision="FP16" names="fc4.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="fc4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/fc4/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_33_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="44" name="Constant_33" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="Multiply_36" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_34_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="47" name="Constant_34" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="fc4.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="38935554" size="256" />
			<output>
				<port id="0" precision="FP16" names="fc4.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="fc4.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_37" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/fc4/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc4/Gemm_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_3_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="fc5.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="38935810" size="256" />
			<output>
				<port id="0" precision="FP16" names="fc5.weight">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="fc5.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/fc5/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_40_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="57" name="Constant_40" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="Multiply_43" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_41_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33554432" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="60" name="Constant_41" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="61" name="fc5.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="38936066" size="2" />
			<output>
				<port id="0" precision="FP16" names="fc5.bias">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="fc5.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Multiply_44" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="output" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="32" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1" />
		<edge from-layer="32" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="37" to-port="0" />
		<edge from-layer="35" from-port="0" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="1" to-layer="42" to-port="0" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1" />
		<edge from-layer="42" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="51" to-port="0" />
		<edge from-layer="46" from-port="0" to-layer="47" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1" />
		<edge from-layer="50" from-port="2" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0" />
		<edge from-layer="52" from-port="1" to-layer="55" to-port="0" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="0" />
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="58" to-port="0" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="0" />
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1" />
		<edge from-layer="58" from-port="2" to-layer="64" to-port="0" />
		<edge from-layer="59" from-port="0" to-layer="60" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="63" to-port="0" />
		<edge from-layer="61" from-port="0" to-layer="62" to-port="0" />
		<edge from-layer="62" from-port="1" to-layer="63" to-port="1" />
		<edge from-layer="63" from-port="2" to-layer="64" to-port="1" />
		<edge from-layer="64" from-port="2" to-layer="65" to-port="0" />
	</edges>
	<rt_info />
</net>
